sims/SIM_Slosh_80/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
    (0 0 0)
    (0.4166667 0 0)
    (0.4166667 0.4166667 0)
    (0 0.4166667 0)
    (0 0 1)
    (0.4166667 0 1)
    (0.4166667 0.4166667 1)
    (0 0.4166667 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 40 80)
    simpleGrading (1 1 5)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
