sims/SIM_Slosh_80/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format ascii;
    class dictionary;
    location "system";
    object controlDict;
}

application     interFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         3.0;

deltaT          0.001;

writeControl    adjustableRunTime;
writeInterval   0.01;

adjustTimeStep  yes;
maxCo           0.3;
maxAlphaCo      0.3;


// ************************************************************************* //
